<a href="https://colab.research.google.com/github/khusanovich/Data_science_and_AI/blob/main/2_2_2_DataFrame.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
import numpy as np

In [ ]:
from pandas import DataFrame as df

In [ ]:
data = {'Yil':[2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
       'Aholi soni':[33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5],
       "Temp":[1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53]}
df0 = df(data)

In [ ]:
df0

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65
5  2016        31.4  1.66
6  2015        30.9  1.64
7  2010        28.5  1.53

In [ ]:
df0.head()

    Yil  Aholi soni  Temp
0  2021        33.9  1.54
1  2020        33.5  1.48
2  2019        32.9  1.56
3  2018        32.5  1.62
4  2017        31.9  1.65

In [ ]:
df0 = df(data, columns=['Year', 'Temp', 'Population'])

In [ ]:
df0

  Year  Temp Population
0  NaN  1.54        NaN
1  NaN  1.48        NaN
2  NaN  1.56        NaN
3  NaN  1.62        NaN
4  NaN  1.65        NaN
5  NaN  1.66        NaN
6  NaN  1.64        NaN
7  NaN  1.53        NaN

In [ ]:
df0['Yil'] = 'Year'

In [ ]:
df0['Year']

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
6    NaN
7    NaN
Name: Year, dtype: object

In [ ]:
df0 = df(data, columns=['Yil', 'Temp', 'Aholi soni'])

In [ ]:
df0

    Yil  Temp  Aholi soni
0  2021  1.54        33.9
1  2020  1.48        33.5
2  2019  1.56        32.9
3  2018  1.62        32.5
4  2017  1.65        31.9
5  2016  1.66        31.4
6  2015  1.64        30.9
7  2010  1.53        28.5

Agar `columns` ro'yxarida lug'atda mavjud bo'lmagan ustin bo'lsa, shu ustunga bo'sh qiymatlar qo'yib ketiladi.

In [ ]:
df0

    Yil  Temp  Aholi soni
0  2021  1.54        33.9
1  2020  1.48        33.5
2  2019  1.56        32.9
3  2018  1.62        32.5
4  2017  1.65        31.9
5  2016  1.66        31.4
6  2015  1.64        30.9
7  2010  1.53        28.5

In [ ]:
df0 = df(data, columns=['Yil', 'Temp', 'Aholi soni', 'YAIM'])

In [ ]:
df0

    Yil  Temp  Aholi soni YAIM
0  2021  1.54        33.9  NaN
1  2020  1.48        33.5  NaN
2  2019  1.56        32.9  NaN
3  2018  1.62        32.5  NaN
4  2017  1.65        31.9  NaN
5  2016  1.66        31.4  NaN
6  2015  1.64        30.9  NaN
7  2010  1.53        28.5  NaN

In [ ]:
df0.head()

    Yil  Temp  Aholi soni YAIM
0  2021  1.54        33.9  NaN
1  2020  1.48        33.5  NaN
2  2019  1.56        32.9  NaN
3  2018  1.62        32.5  NaN
4  2017  1.65        31.9  NaN

In [ ]:
df0 = df(data, columns=['Yil', 'Temp', 'Aholi soni', 'YAIM'], index=[21, 20, 19, 18, 17, 16, 10, 9])

In [ ]:
df0

     Yil  Temp  Aholi soni YAIM
21  2021  1.54        33.9  NaN
20  2020  1.48        33.5  NaN
19  2019  1.56        32.9  NaN
18  2018  1.62        32.5  NaN
17  2017  1.65        31.9  NaN
16  2016  1.66        31.4  NaN
10  2015  1.64        30.9  NaN
9   2010  1.53        28.5  NaN

In [ ]:
# 1- usul ustun nomi bir so'zdan iborat bo'lganda mumkin
df0.Yil # ustunni Series ko'rinishida olamiz

21    2021
20    2020
19    2019
18    2018
17    2017
16    2016
10    2015
9     2010
Name: Yil, dtype: int64

In [ ]:
df0['Aholi soni'] # ustun nomi 2 ta so'zdan iborat holat uchun

21    33.9
20    33.5
19    32.9
18    32.5
17    31.9
16    31.4
10    30.9
9     28.5
Name: Aholi soni, dtype: float64

In [ ]:
df0.YAIM = 1800

In [ ]:
df0

     Yil  Temp  Aholi soni  YAIM
21  2021  1.54        33.9  1800
20  2020  1.48        33.5  1800
19  2019  1.56        32.9  1800
18  2018  1.62        32.5  1800
17  2017  1.65        31.9  1800
16  2016  1.66        31.4  1800
10  2015  1.64        30.9  1800
9   2010  1.53        28.5  1800

`Series` yordamida biror ustunning ma'lum bir qatorlariga o'zgartirish kiritish mumkin. Bunda qatorlarning indeksi berilishi shart.

In [ ]:
misol = pd.Series([1789, 1230, 1450], index=[18, 10, 9])

In [ ]:
misol

18    1789
10    1230
9     1450
dtype: int64

In [ ]:
df0

     Yil  Temp  Aholi soni  YAIM
21  2021  1.54        33.9  1800
20  2020  1.48        33.5  1800
19  2019  1.56        32.9  1800
18  2018  1.62        32.5  1800
17  2017  1.65        31.9  1800
16  2016  1.66        31.4  1800
10  2015  1.64        30.9  1800
9   2010  1.53        28.5  1800

In [ ]:
df0.YAIM = misol

In [ ]:
df0

     Yil  Temp  Aholi soni    YAIM
21  2021  1.54        33.9     NaN
20  2020  1.48        33.5     NaN
19  2019  1.56        32.9     NaN
18  2018  1.62        32.5  1789.0
17  2017  1.65        31.9     NaN
16  2016  1.66        31.4     NaN
10  2015  1.64        30.9  1230.0
9   2010  1.53        28.5  1450.0

Shuningdek ustun qiymatlarini o'zgartirish uchun shu ustun qatorlari soniga teng ro'yxatdan foydalanishimiz mumkin.

In [ ]:
YAIM = [1290, 1200, 1200, 1300, 1230, 1500, 2000, 1000]

In [ ]:
df0

     Yil  Temp  Aholi soni    YAIM
21  2021  1.54        33.9     NaN
20  2020  1.48        33.5     NaN
19  2019  1.56        32.9     NaN
18  2018  1.62        32.5  1789.0
17  2017  1.65        31.9     NaN
16  2016  1.66        31.4     NaN
10  2015  1.64        30.9  1230.0
9   2010  1.53        28.5  1450.0

In [ ]:
df0['YAIM'] = YAIM

In [ ]:
df0

     Yil  Temp  Aholi soni  YAIM
21  2021  1.54        33.9  1290
20  2020  1.48        33.5  1200
19  2019  1.56        32.9  1200
18  2018  1.62        32.5  1300
17  2017  1.65        31.9  1230
16  2016  1.66        31.4  1500
10  2015  1.64        30.9  2000
9   2010  1.53        28.5  1000

Agar qiymat berishda mavjud bo'lmagan ustun nomi yozilsa, `DataFrame`ga yangi ustun qo'shiladi (bu faqat lug'at ko'rinishda yozishga xos). 

Quyidagi misolda biz avval yangi `1500+` degan ustun yaratdik keyin esa bu ustun qiymatlarini `df.YAIM>1500` sharti yordamida to'ldridik (ya'ni yalpi ichki mahsluot `1500` dan katta bo'lsa `True` aks holda 'False`.

In [ ]:
df0["1200+"] = df0.YAIM>1200

In [ ]:
df0

     Yil  Temp  Aholi soni  YAIM  1200+
21  2021  1.54        33.9  1290   True
20  2020  1.48        33.5  1200  False
19  2019  1.56        32.9  1200  False
18  2018  1.62        32.5  1300   True
17  2017  1.65        31.9  1230   True
16  2016  1.66        31.4  1500   True
10  2015  1.64        30.9  2000   True
9   2010  1.53        28.5  1000  False

Huddi lug'atlardagi kabi istalgan ustunni del operatori yordamida o'chirib tashlash ham mumkin.

In [ ]:
del df0["1200+"]

In [ ]:
df0

     Yil  Temp  Aholi soni  YAIM
21  2021  1.54        33.9  1290
20  2020  1.48        33.5  1200
19  2019  1.56        32.9  1200
18  2018  1.62        32.5  1300
17  2017  1.65        31.9  1230
16  2016  1.66        31.4  1500
10  2015  1.64        30.9  2000
9   2010  1.53        28.5  1000

`DataFrame` yaratishning yana bir usuli lug'atlar lug'atidan foydalanish. Bunda tashqi lug'at kalitlari ustun, ichki lug'at kalitlari esa indeks bo'ladi.

In [ ]:
data = {
    'Uzbekistan':{2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'Kazakhstan':{2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8},
    'Germany':{2021:36.9, 2020:35.5, 2019:32.9, 2018:32.5, 2017:38.9},
}

In [ ]:
df1 = df(data)

In [ ]:
df1

      Uzbekistan  Kazakhstan  Germany
2021        33.9        18.9     36.9
2020        33.5        18.7     35.5
2019        32.9        18.5     32.9
2018        32.5        18.3     32.5
2017        31.9        18.1     38.9
2016         NaN        17.8      NaN

E'tibor bering, Uzbekistan ustunda 2016 yil uchun qiymat yo'q. Sababi nimada?

Huddi `Series` kabi, `DataFrame` indeksini ham nomlashimiz mumkin.

In [ ]:
df1.index.name='Year'

In [ ]:
df1

      Uzbekistan  Kazakhstan  Germany
Year
2021        33.9        18.9     36.9
2020        33.5        18.7     35.5
2019        32.9        18.5     32.9
2018        32.5        18.3     32.5
2017        31.9        18.1     38.9
2016         NaN        17.8      NaN

Agar biz lug'atdan faqagina ma'lum bir qiymatlarni ajratib olishni istasak index ni o'zimiz ko'rsatishimiz mumkin.

In [ ]:
df1 = df(data, index=[2021, 2020, 2019])

In [ ]:
df1

      Uzbekistan  Kazakhstan  Germany
2021        33.9        18.9     36.9
2020        33.5        18.7     35.5
2019        32.9        18.5     32.9

Indekslar va Ustunlar o'rnini almashtirish uchun `.T` (transpose) metodidan foydalanish mumkin.

In [ ]:
df1.T

            2021  2020  2019
Uzbekistan  33.9  33.5  32.9
Kazakhstan  18.9  18.7  18.5
Germany     36.9  35.5  32.9

`.values` parametri yordamida `DataFrame` ichidagi qiymatlarni 2-o'lchamli massiv ko'rinishida olishimiz mumkin.

In [ ]:
df1.values

array([[33.9, 18.9, 36.9],
       [33.5, 18.7, 35.5],
       [32.9, 18.5, 32.9]])

In [ ]:
df1

      Uzbekistan  Kazakhstan  Germany
2021        33.9        18.9     36.9
2020        33.5        18.7     35.5
2019        32.9        18.5     32.9

In [ ]:
indekslar = df1.index

In [ ]:
indekslar

Int64Index([2021, 2020, 2019], dtype='int64')

`Index` elementlariga tartib raqami bo'yciha murojaat qilishimiz mumkin

In [ ]:
indekslar[0]

2021

In [ ]:
indekslar[1]

2020

In [ ]:
indekslar[-1]

2019

In [ ]:
indekslar[2:3]

Int64Index([2019], dtype='int64')

`Index` obyektining qiymatlarini o'zgartirib bo'lmaydi

In [ ]:
indekslar[1] = 2022

TypeError: ignored

In [ ]:
data1 = {
    'Uzbekistan':{2021:33.9, 2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9},
    'Kazakhstan':{2021:18.9, 2020:18.7, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8},
    'Germany':{2021:36.9, 2020:35.5, 2019:32.9, 2018:32.5, 2017:38.9},
}

In [ ]:
df1.columns

Index(['Uzbekistan', 'Kazakhstan', 'Germany'], dtype='object')

In [ ]:
'England' in df1.columns

False

In [ ]:
2020 in df1.index

True

Python ro'yxatlaridan farqli ravishda `Index` takrorlanuvchi qiymatlar ega bo'lishi mumkin:

In [ ]:
usernames = {"anvar":"anvarbek223", "olim":"olimtoy", "maryam":"mary334455","javohir":"javohir445"}
emails = {"anvar":"anvar@gmail.com", "olim":"olim@mail.ru", "maryam":"mary33@gmail.com","javohir":"javohir445@gmail.com"}

data2 = {
    'username':usernames,
    'email':emails
}
df2 = pd.DataFrame(data2)

In [ ]:
df2

            username                 email
anvar    anvarbek223       anvar@gmail.com
olim         olimtoy          olim@mail.ru
maryam    mary334455      mary33@gmail.com
javohir   javohir445  javohir445@gmail.com

In [ ]:
data3 = {
    'username':{"olim":"olimjon21", "maryam":"maryam2020"},
    'email':{"olim":"olimjon21@mail.ru", "maryam":"maryam20@gmail.com"}
}

In [ ]:
df3 = df.append(pd.DataFrame(data3))

In [ ]:
df3

            username                 email
anvar    anvarbek223       anvar@gmail.com
olim         olimtoy          olim@mail.ru
maryam    mary334455      mary33@gmail.com
javohir   javohir445  javohir445@gmail.com
olim       olimjon21     olimjon21@mail.ru
maryam    maryam2020    maryam20@gmail.com

In [ ]:
df3.index

Index(['anvar', 'olim', 'maryam', 'javohir', 'olim', 'maryam'], dtype='object')

In [ ]:
newind = pd.Index(['olim','nafisa','hamida']) # yangi indeks yaratamiz
newind

Index(['olim', 'nafisa', 'hamida'], dtype='object')

**Indeks boshqa indeks tarkibida ekanini tekshirish**

In [ ]:
newind.isin(df3.index)

array([ True, False, False])

**Indeksning boshqa indeksdan farqini tekshirish**

In [ ]:
df3.index.difference(newind)

Index(['anvar', 'javohir', 'maryam'], dtype='object')

In [90]:
newind.difference(df3.index)

Index(['hamida', 'nafisa'], dtype='object')

**Ikki indeks to'plami**

In [91]:
df3.index.union(newind)

Index(['anvar', 'hamida', 'javohir', 'maryam', 'maryam', 'nafisa', 'olim',
       'olim'],
      dtype='object')

**`.delete()` va `.drop()`**

In [93]:
df3.index.delete(0)

Index(['olim', 'maryam', 'javohir', 'olim', 'maryam'], dtype='object')

In [100]:
df3.index

Index(['anvar', 'olim', 'maryam', 'javohir', 'olim', 'maryam'], dtype='object')

In [101]:
df3.index.insert(5, 'masha'). # 5-o'ringa mashani qo'shamiz

Index(['anvar', 'olim', 'maryam', 'javohir', 'olim', 'masha', 'maryam'], dtype='object')

`.is_monotonic` va `.is_unique`

In [102]:
df3.index.is_monotonic

False

In [103]:
 df3.index.is_unique

False

In [104]:
newind

Index(['olim', 'nafisa', 'hamida'], dtype='object')

In [105]:
df3.index.unique # noyob (takrorlanmas) elementlar